---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyGridLinesWarn
source: html/d9eb7c33-214c-7af7-599c-ed028808a0c9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyGridLinesWarn Property

Curtain grid lines cannot be copied. If you are trying to copy the curtain wall, try using tab to select entire wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyGridLinesWarn { get; }
```